<!-- dflook/terraform-github-actions {"workspace":"default","backend":"3f32fd81318d844aefdab46f5d324bdb63f75a1ddcc3484f74ae42fcae3f3ed1","backend_type":"gcs","plan_job_ref":"Job Create terraform plan #32 at https://github.com/paulsilcock/gke-terraform/actions/runs/3471702610","plan_hash":"b6271eb07b3b6e936f80b355f7e3f5bec5ec965771c8a0e83cacc8fe2ee6044f","plan_text_format":"text"} -->
Terraform plan in __terraform__
<details>
<summary>Plan: 10 to add, 2 to change, 0 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_compute_address.ingress will be updated in-place
  ~ resource "google_compute_address" "ingress" {
        id                 = "projects/gothic-album-364814/regions/europe-west2/addresses/ingress-nginx-lb"
      ~ labels             = {
          + "kubeip" = "k8s-cluster"
        }
        name               = "ingress-nginx-lb"
        # (10 unchanged attributes hidden)
    }

  # google_container_node_pool.ingress will be created
  + resource "google_container_node_pool" "ingress" {
      + cluster                     = "k8s-cluster"
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + location                    = "europe-west2-a"
      + managed_instance_group_urls = (known after apply)
      + max_pods_per_node           = (known after apply)
      + name                        = "k8s-cluster-ingress-nodepool"
      + name_prefix                 = (known after apply)
      + node_count                  = (known after apply)
      + node_locations              = (known after apply)
      + operation                   = (known after apply)
      + project                     = (known after apply)
      + version                     = (known after apply)

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 10
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = "e2-micro"
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = "k8s-cluster-sa@gothic-album-364814.iam.gserviceaccount.com"
          + spot              = true
          + taint             = [
              + {
                  + effect = "NO_SCHEDULE"
                  + key    = "dedicated"
                  + value  = "ingress"
                },
            ]

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + mode = (known after apply)
            }
        }

      + timeouts {
          + create = "20m"
          + update = "20m"
        }

      + upgrade_settings {
          + max_surge       = (known after apply)
          + max_unavailable = (known after apply)
        }
    }

  # google_project_iam_custom_role.kubeip_role will be created
  + resource "google_project_iam_custom_role" "kubeip_role" {
      + deleted     = (known after apply)
      + description = "required permissions to run KubeIP"
      + id          = (known after apply)
      + name        = (known after apply)
      + permissions = [
          + "compute.addresses.list",
          + "compute.addresses.use",
          + "compute.instances.addAccessConfig",
          + "compute.instances.deleteAccessConfig",
          + "compute.instances.get",
          + "compute.instances.list",
          + "compute.networks.useExternalIp",
          + "compute.projects.get",
          + "compute.subnetworks.useExternalIp",
          + "container.clusters.get",
          + "container.clusters.list",
          + "resourcemanager.projects.get",
        ]
      + project     = "gothic-album-364814"
      + role_id     = "***********"
      + stage       = "GA"
      + title       = "KubeIP Role"
    }

  # google_project_iam_member.kubeip_role_binding will be created
  + resource "google_project_iam_member" "kubeip_role_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:kube-ip-manager@gothic-album-364814.iam.gserviceaccount.com"
      + project = "gothic-album-364814"
      + role    = "projects/gothic-album-364814/roles/kubeip_role"
    }

  # google_service_account.kubeip_service_account will be created
  + resource "google_service_account" "kubeip_service_account" {
      + account_id   = "***************"
      + disabled     = false
      + display_name = "kubeIP"
      + email        = (known after apply)
      + id           = (known after apply)
      + member       = (known after apply)
      + name         = (known after apply)
      + project      = "gothic-album-364814"
      + unique_id    = (known after apply)
    }

  # google_service_account_iam_member.sa_iam_member will be created
  + resource "google_service_account_iam_member" "sa_iam_member" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = "serviceAccount:gothic-album-364814.svc.id.goog[kube-system/kube-ip]"
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # helm_release.nginx will be updated in-place
  ~ resource "helm_release" "nginx" {
        id                         = "ingress-nginx"
        name                       = "ingress-nginx"
        # (27 unchanged attributes hidden)

      + set {
          + name  = "controller.hostNetwork"
          + value = "true"
        }
      - set {
          - name  = "controller.service.loadBalancerIP" -> null
          - value = "34.89.32.55" -> null
        }
    }

  # kubernetes_cluster_role.kubeip will be created
  + resource "kubernetes_cluster_role" "kubeip" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "kubeip"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "pods",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
            ]
        }
      + rule {
          + api_groups = [
              + "",
            ]
          + resources  = [
              + "nodes",
            ]
          + verbs      = [
              + "get",
              + "list",
              + "watch",
              + "patch",
            ]
        }
    }

  # kubernetes_cluster_role_binding.kubeip will be created
  + resource "kubernetes_cluster_role_binding" "kubeip" {
      + id = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "kubeip"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + role_ref {
          + api_group = "rbac.authorization.k8s.io"
          + kind      = "ClusterRole"
          + name      = "cluster-admin"
        }

      + subject {
          + api_group = (known after apply)
          + kind      = "ServiceAccount"
          + name      = "kube-ip"
          + namespace = "kube-system"
        }
    }

  # kubernetes_config_map.kubeip_configmap will be created
  + resource "kubernetes_config_map" "kubeip_configmap" {
      + data = {
          + "KUBEIP_ADDITIONALNODEPOOLS" = ""
          + "KUBEIP_ALLNODEPOOLS"        = "false"
          + "KUBEIP_FORCEASSIGNMENT"     = "true"
          + "KUBEIP_LABELKEY"            = "kubeip"
          + "KUBEIP_LABELVALUE"          = "k8s-cluster"
          + "KUBEIP_NODEPOOL"            = "k8s-cluster-ingress-nodepool"
          + "KUBEIP_TICKER"              = "5"
        }
      + id   = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "kubeip"
            }
          + name             = "kubeip-config"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # kubernetes_deployment.kubeip will be created
  + resource "kubernetes_deployment" "kubeip" {
      + id               = (known after apply)
      + wait_for_rollout = true

      + metadata {
          + generation       = (known after apply)
          + labels           = {
              + "app" = "kubeip"
            }
          + name             = "kubeip"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }

      + spec {
          + min_ready_seconds         = 0
          + paused                    = false
          + progress_deadline_seconds = 600
          + replicas                  = "1"
          + revision_history_limit    = 10

          + selector {
              + match_labels = {
                  + "app" = "kubeip"
                }
            }

          + strategy {
              + type = (known after apply)

              + rolling_update {
                  + max_surge       = (known after apply)
                  + max_unavailable = (known after apply)
                }
            }

          + template {
              + metadata {
                  + generation       = (known after apply)
                  + labels           = {
                      + "app" = "kubeip"
                    }
                  + name             = (known after apply)
                  + resource_version = (known after apply)
                  + uid              = (known after apply)
                }

              + spec {
                  + automount_service_account_token  = true
                  + dns_policy                       = "ClusterFirst"
                  + enable_service_links             = true
                  + host_ipc                         = false
                  + host_network                     = false
                  + host_pid                         = false
                  + hostname                         = (known after apply)
                  + node_name                        = (known after apply)
                  + node_selector                    = {
                      + "cloud.google.com/gke-nodepool" = "k8s-cluster-generic-nodepool"
                    }
                  + priority_class_name              = "system-node-critical"
                  + restart_policy                   = "Always"
                  + service_account_name             = "kube-ip"
                  + share_process_namespace          = false
                  + termination_grace_period_seconds = 30

                  + container {
                      + image                      = "doitintl/kubeip:latest"
                      + image_pull_policy          = (known after apply)
                      + name                       = "kubeip"
                      + stdin                      = false
                      + stdin_once                 = false
                      + termination_message_path   = "/dev/termination-log"
                      + termination_message_policy = (known after apply)
                      + tty                        = false

                      + env_from {
                          + config_map_ref {
                              + name = "kubeip-config"
                            }
                        }

                      + resources {
                          + limits   = {
                              + "cpu"    = "50"
                              + "memory" = "50Mi"
                            }
                          + requests = {
                              + "cpu"    = "50m"
                              + "memory" = "50Mi"
                            }
                        }
                    }

                  + image_pull_secrets {
                      + name = (known after apply)
                    }

                  + readiness_gate {
                      + condition_type = (known after apply)
                    }

                  + volume {
                      + name = (known after apply)

                      + aws_elastic_block_store {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + azure_disk {
                          + caching_mode  = (known after apply)
                          + data_disk_uri = (known after apply)
                          + disk_name     = (known after apply)
                          + fs_type       = (known after apply)
                          + kind          = (known after apply)
                          + read_only     = (known after apply)
                        }

                      + azure_file {
                          + read_only        = (known after apply)
                          + secret_name      = (known after apply)
                          + secret_namespace = (known after apply)
                          + share_name       = (known after apply)
                        }

                      + ceph_fs {
                          + monitors    = (known after apply)
                          + path        = (known after apply)
                          + read_only   = (known after apply)
                          + secret_file = (known after apply)
                          + user        = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + cinder {
                          + fs_type   = (known after apply)
                          + read_only = (known after apply)
                          + volume_id = (known after apply)
                        }

                      + config_map {
                          + default_mode = (known after apply)
                          + name         = (known after apply)
                          + optional     = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + csi {
                          + driver            = (known after apply)
                          + fs_type           = (known after apply)
                          + read_only         = (known after apply)
                          + volume_attributes = (known after apply)

                          + node_publish_secret_ref {
                              + name = (known after apply)
                            }
                        }

                      + downward_api {
                          + default_mode = (known after apply)

                          + items {
                              + mode = (known after apply)
                              + path = (known after apply)

                              + field_ref {
                                  + api_version = (known after apply)
                                  + field_path  = (known after apply)
                                }

                              + resource_field_ref {
                                  + container_name = (known after apply)
                                  + divisor        = (known after apply)
                                  + resource       = (known after apply)
                                }
                            }
                        }

                      + empty_dir {
                          + medium     = (known after apply)
                          + size_limit = (known after apply)
                        }

                      + fc {
                          + fs_type      = (known after apply)
                          + lun          = (known after apply)
                          + read_only    = (known after apply)
                          + target_ww_ns = (known after apply)
                        }

                      + flex_volume {
                          + driver    = (known after apply)
                          + fs_type   = (known after apply)
                          + options   = (known after apply)
                          + read_only = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + flocker {
                          + dataset_name = (known after apply)
                          + dataset_uuid = (known after apply)
                        }

                      + gce_persistent_disk {
                          + fs_type   = (known after apply)
                          + partition = (known after apply)
                          + pd_name   = (known after apply)
                          + read_only = (known after apply)
                        }

                      + git_repo {
                          + directory  = (known after apply)
                          + repository = (known after apply)
                          + revision   = (known after apply)
                        }

                      + glusterfs {
                          + endpoints_name = (known after apply)
                          + path           = (known after apply)
                          + read_only      = (known after apply)
                        }

                      + host_path {
                          + path = (known after apply)
                          + type = (known after apply)
                        }

                      + iscsi {
                          + fs_type         = (known after apply)
                          + iqn             = (known after apply)
                          + iscsi_interface = (known after apply)
                          + lun             = (known after apply)
                          + read_only       = (known after apply)
                          + target_portal   = (known after apply)
                        }

                      + local {
                          + path = (known after apply)
                        }

                      + nfs {
                          + path      = (known after apply)
                          + read_only = (known after apply)
                          + server    = (known after apply)
                        }

                      + persistent_volume_claim {
                          + claim_name = (known after apply)
                          + read_only  = (known after apply)
                        }

                      + photon_persistent_disk {
                          + fs_type = (known after apply)
                          + pd_id   = (known after apply)
                        }

                      + projected {
                          + default_mode = (known after apply)

                          + sources {
                              + config_map {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + downward_api {
                                  + items {
                                      + mode = (known after apply)
                                      + path = (known after apply)

                                      + field_ref {
                                          + api_version = (known after apply)
                                          + field_path  = (known after apply)
                                        }

                                      + resource_field_ref {
                                          + container_name = (known after apply)
                                          + divisor        = (known after apply)
                                          + resource       = (known after apply)
                                        }
                                    }
                                }

                              + secret {
                                  + name     = (known after apply)
                                  + optional = (known after apply)

                                  + items {
                                      + key  = (known after apply)
                                      + mode = (known after apply)
                                      + path = (known after apply)
                                    }
                                }

                              + service_account_token {
                                  + audience           = (known after apply)
                                  + expiration_seconds = (known after apply)
                                  + path               = (known after apply)
                                }
                            }
                        }

                      + quobyte {
                          + group     = (known after apply)
                          + read_only = (known after apply)
                          + registry  = (known after apply)
                          + user      = (known after apply)
                          + volume    = (known after apply)
                        }

                      + rbd {
                          + ceph_monitors = (known after apply)
                          + fs_type       = (known after apply)
                          + keyring       = (known after apply)
                          + rados_user    = (known after apply)
                          + rbd_image     = (known after apply)
                          + rbd_pool      = (known after apply)
                          + read_only     = (known after apply)

                          + secret_ref {
                              + name      = (known after apply)
                              + namespace = (known after apply)
                            }
                        }

                      + secret {
                          + default_mode = (known after apply)
                          + optional     = (known after apply)
                          + secret_name  = (known after apply)

                          + items {
                              + key  = (known after apply)
                              + mode = (known after apply)
                              + path = (known after apply)
                            }
                        }

                      + vsphere_volume {
                          + fs_type     = (known after apply)
                          + volume_path = (known after apply)
                        }
                    }
                }
            }
        }

      + timeouts {
          + create = "3m"
          + delete = "3m"
          + update = "3m"
        }
    }

  # kubernetes_service_account.kubeip will be created
  + resource "kubernetes_service_account" "kubeip" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + annotations      = (known after apply)
          + generation       = (known after apply)
          + name             = "kube-ip"
          + namespace        = "kube-system"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

Plan: 10 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ cluster_ingress_ip = {
        id                 = "projects/gothic-album-364814/regions/europe-west2/addresses/ingress-nginx-lb"
      + label_fingerprint  = "42WmSpB8rSM="
      + labels             = {
          + "kubeip" = "k8s-cluster"
        }
        name               = "ingress-nginx-lb"
      ~ users              = [
          - "https://www.googleapis.com/compute/v1/projects/gothic-album-364814/regions/europe-west2/forwardingRules/a5b24489b19644e1d861449a77034338",
          + "https://www.googleapis.com/compute/beta/projects/gothic-album-364814/regions/europe-west2/forwardingRules/a5b24489b19644e1d861449a77034338",
        ]
        # (13 unchanged elements hidden)
    }

Invalid attribute in provider configuration

  with provider["registry.terraform.io/hashicorp/kubernetes"],
  on provider.tf line 24, in provider "kubernetes":
  24: provider "kubernetes" {

'host' is not a valid URL
```
</details>

:memo: Plan generated in [Create terraform plan #32](https://github.com/paulsilcock/gke-terraform/actions/runs/3471702610)